{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "hi there",
                "is anyone there?",
                "hey",
                "hola",
                "hello",
                "namaste",
                "what is up",
                "yo",
                "hi"
            ],
            "responses": [
                "Hello! I am here to listen.",
                "Good to see you. How are you feeling today?",
                "Hi there, how can I support you today?",
                "Hi! What is on your mind?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "farewell",
            "patterns": [
                "bye",
                "see you later",
                "goodbye",
                "catch you later"
            ],
            "responses": [
                "Goodbye! Take care.",
                "Remember, I am always here if you need to talk.",
                "Bye! Come back anytime you need support.",
                "Take care and be kind to yourself."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "thanks",
                "thank you",
                "that's helpful",
                "i appreciate it",
                "thanks for listening",
                "thanks for helping me",
                "thanks bro"
            ],
            "responses": [
                "You are welcome! I am glad I could help.",
                "Happy to be here for you.",
                "Anytime! Reach out whenever you need support.",
                "My pleasure. Take care!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "how_are_you",
            "patterns": [
                "how are you",
                "how are you doing?",
                "what is up with you?",
                "how's your day?",
                "how's it going?"
            ],
            "responses": [
                "I am doing well, thank you! How about you?",
                "I am here to listen to you. How are you feeling?",
                "I am always ready to help. How are you doing?",
                "I am here for you. How are you feeling today?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "feeling_down",
            "patterns": [
                "i feel sad",
                "i am not fine",
                "i am feeling down",
                "i am upset",
                "i am not okay",
                "i feel low",
                "i am fed up",
                "i am feeling emotional",
                "i do not feel like myself today ",
                "i am not feeling well",
                "i do not want to get out of bed",
                 "i am not in a good mood",
                 "i am in deep trouble"
            ],
            "responses": [
                "I am sorry you are feeling this way. Want to tell me what has been bothering you",
                "I am here for you.Would you like to share what is bothering you",
                "It is okay to feel this way sometimes. Take your time, and let me know how I can help.",
                "Do you want to tell me about what is making you feel this way?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "anxiety",
            "patterns": [
                "i am anxious",
                "i feel anxious",
                "i have anxiety",
                "i can't calm down",
                "i feel nervous",
                "i am worried"
            ],
            "responses": [
                "I am sorry you are feeling anxious. Let us take a deep breath together.",
                "It sounds like a lot is on your mind. I am here if you want to talk.",
                "Anxiety can feel overwhelming, but you are not alone. I am here to listen.",
                "Try to focus on your breathing for a moment. I am here with you."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "stress",
            "patterns": [
                "i am stressed",
                "i feel stressed",
                "i am under a lot of pressure",
                "i can't handle the stress",
                "i am overwhelmed",
                "i am stressed out"
            ],
            "responses": [
                "I am sorry you are feeling stressed. Would you like to share what has been stressing you out.",
                "I am here to help you sort through your thoughts. Take your time and tell me .",
                "It is okay to feel overwhelmed sometimes. Let us talk about what has been bothering you."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "loneliness",
            "patterns": [
                "i feel lonely",
                "I am alone",
                "nobody understands me",
                "i have no one",
                "I am isolated",
                "i am lonely"
            ],
            "responses": [
                "I am really sorry you are feeling lonely. Remember, I am here with you.",
                "It can be tough to feel alone. Please tell me all about it.",
     "I understand how hard that can be. I am here for you, whenever you need someone to  talk to.",
                "You are not truly alone. I am right here, listening to you."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "self_esteem",
            "patterns": [
                "i do not feel good about myself",
                "i am not enough",
                "i have low self-esteem",
                "i feel worthless",
                "i have no confidence in myself.",
                " i  always doubt myself "
            ],
            "responses": [
                "I am really sorry you are feeling this way. You are worthy and valuable.",
                "It can be hard to feel confident, but remember you have unique strengths.",
                "Self-esteem takes time to build, and It is okay to feel this way. Tell me what makes you feel this way, I am here to listen.",
                "You are important, and your feelings matter. I am here to listen."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "depression",
            "patterns": [
                "i am depressed",
                "i am in depression",
                "i feel hopeless",
                "everything feels pointless",
                "i am struggling with depression",
                "i am in a dark place"
            ],
            "responses": [
                "I am so sorry you are feeling this way. It sounds really tough. I am here for you.",
                "It is okay to feel this way, but you do not have to face it alone. Let us talk about the good memories . Please do share if you like.",
                "Depression can be incredibly hard to deal with. Let’s take it one step at a time. I am here for you.",
                "I am really sorry you are feeling this low. Would it help to talk about what is weighing on you?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "suicide",
            "patterns": [
                "i do not want to live",
                "i want to hurt myself",
                "i want to kill myself",
                "i want to unalive myself",
                "suicide",
                "self harm",
                "I am going to kill myself",
                "i feel like dying ",
                "I think of suiciding everyday"
            ],
            "responses": [
                "You are important, and your life has value.  You can talk to your close ones about your problems or can contact a Helpline at 9152987821 or visit https://icallhelpline.org/ . You do not have to go through this alone."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "coping_strategies",
            "patterns": [
                "how can I cope with stress?",
                "how do I deal with anxiety?",
                "how can I calm down?",
                "give me tips for managing stress",
                "what are good coping mechanisms?"
            ],
            "responses": [
                "Some people find mindfulness or deep breathing helpful. Do you want to try a breathing exercise?",
                "Journaling, talking to a friend, or taking a break can help. What usually works for you?",
                "Physical activity or grounding techniques can sometimes help with stress. I can guide you through a short relaxation technique if you'd like.",
                "When anxiety  or stress gets overwhelming, focusing on one thing at a time can help. How are you feeling now?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "handle stress",
            "patterns": [
                "how to cope with mental stress",
                "what are the ways to improve coping strategies in managing stress or negative feelings?",
                "manage stress",
                "manage anxiety",
                "stop stress",
                "stop anxiety",
                "stop negative feelings",
                "stop bad feelings"
            ],
            "responses": [
                "Engaging in relaxation techniques like mindfulness, exercise, or deep breathing can effectively help cope with mental stress",
                "Practicing mindfulness, developing a strong support network, and engaging in regular physical activity can improve your coping strategies for managing stress and negative feelings.",
                "Identifying triggers and using stress-reduction techniques, such as mindfulness or keeping your hands busy, can help control anxiety and nail-biting.",
                "Therapy, medication, lifestyle changes like exercise and nutrition, and support groups are various ways to deal with mental health problems."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "standup against bullying",
            "patterns": [
                "how to prevent, how to stop or how to talk it out with the bully",
                "how to stand up against bullying",
                "how do we fight back bullying?",
                " stop bullying",
                " prevent bullying",
                "i am being bullied"
            ],
            "responses": [
                "To prevent bullying, assertively communicate your boundaries, seek support from trusted friends or adults, and consider discussing the issue directly with the bully in a calm manner if you feel safe doing so. Seek support from your school council members.",
                "Standing up against bullying involves speaking out against the behavior, supporting the victim, and reporting the incidents to teachers or the student council."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": " future uncertainty",
            "patterns": [
                "how to stop worrying about the future? ",
                "i am worried about my future ",
                "what can i do to stop worrying about my future? ",
                "i am scared due to future uncertainty "
            ],
            "responses": [
                "Make a list of what specifically worries you. Sometimes, getting it out of your head and onto paper can help you see things more clearly.",
                "Identify areas where you can take action. Break down larger concerns into manageable steps you can work on. ",
                "Setting achievable goals can give you a sense of purpose and direction, making the future feel less daunting. ",
                "Regularly reflecting on what you are grateful for can shift your focus from worry to appreciation. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "sleep",
            "patterns": [
                "i am not able to get proper sleep?",
                "what can i do to get proper sleep",
                "i am worried so i am not getting proper sleep?"
            ],
            "responses": [
                "Go to bed and wake up at the same time every day, even on weekends. This helps regulate your body’s internal clock. ",
                "Engage in calming activities before bed, such as reading, meditating, or taking a warm bath. Avoid screens for at least 30 minutes before sleep.",
                "Engage in physical activity during the day, but try to avoid vigorous exercise close to bedtime. ",
                "Practice mindfulness, deep breathing, or yoga to help calm your mind before bed. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "time",
            "patterns": [
                "how can i manage my time?",
                "what can i do to properly use my hours?",
                "i am not able to manage my time ",
                "i have no time"
            ],
            "responses": [
                "Define short-term and long-term goals to give your tasks direction and purpose. ",
                " Use methods like the Eisenhower Matrix to distinguish between what is urgent and important, helping you focus on what truly matters. ",
                "Plan your day with time blocks for specific activities. This can help you allocate time for work, breaks, and personal tasks. ",
                "Regularly review how you spend your time and adjust your strategies as needed to improve efficiency. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "social connections",
            "patterns": [
                "how can i strengthen my relationships with friends and family?",
                "what are some ways to meet new people and build connections?",
                "what can i do to make sure that i have a healthy relationship with all the close people around me? "
            ],
            "responses": [
                "Be honest and open about your feelings. Encourage others to share theirs, too. Listen actively and without judgment. ",
                " Clearly communicate your boundaries and respect others' boundaries. This helps prevent misunderstandings and resentment. ",
                "Try to understand things from the other person's perspective. Show compassion and support, especially during difficult time ",
                "Regularly express gratitude and appreciation for the people in your life. Small gestures can make a big difference. ",
                "Make an effort to engage in activities that you all enjoy. Shared experiences strengthen bonds. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "finding joy",
            "patterns": [
                "what activities can help me rediscover joy in my life?",
                "how can i incorporate play and fun into my routine?",
                "what things can help me to relax and enjoy my life?"
            ],
            "responses": [
                "Block out specific times in your week for fun activities, just like you would for work or appointments.",
                "Explore activities that interest you, such as painting, dancing, cooking, or playing a musical instrument.",
                "Allow room for spontaneous fun. Say yes to unexpected invitations or plan spontaneous outings.",
                "Spend time outside. Go for a hike, play sports, or have a picnic in the park."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "affirmations",
            "patterns": [
                "give me some affirmations",
                "tell me something positive",
                "help me feel better about myself",
                "i need a confidence boost",
                "affirmations"
            ],
            "responses": [
                "You are enough, just as you are.",
                "You are capable of handling whatever comes your way.",
                "Your feelings are valid, and you are worthy of love and care.",
                "You are stronger than you think, and you are doing your best."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "gratitude",
            "patterns": [
                "how do I practice gratitude?",
                "what is gratitude?",
                "how can I be more thankful?",
                "gratitude tips"
            ],
            "responses": [
                "Practicing gratitude can be as simple as taking a moment to appreciate something small in your day. What are you grateful for today?",
                "Gratitude can help shift your focus to positive things. Want to list three things you are thankful for?",
                "Being grateful for small things, like a sunny day or a good meal, can improve your mood. Think about something that made you smile today and share with me if you are comfortable."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "noanswer",
            "patterns": [],
            "responses": [
                "Sorry, I cannot answer this ,please ask something I can answer ",
                "Please give me more info",
                "Please ask questions relevant to mental health chatbot"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "options",
            "patterns": [
                "how could you help me?",
                "what can you do?",
                "what help do you provide?",
                "how can you be helpful?",
                "what support is offered?"
            ],
            "responses": [
                "I am a Mental Health Chatbot! I am here to provide support whenever you require!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "jokes",
            "patterns": [
                "tell me a joke",
                "joke",
                "make me laugh"
            ],
            "responses": [
                "A perfectionist walked into a bar...apparently, the bar wasn't set high enough",
                "I ate a clock yesterday, it was very time-consuming",
                "Never criticize someone until you've walked a mile in their shoes. That way, when you criticize them, they won't be able to hear you from that far away. Plus, you'll have their shoes.",
                "The world tongue-twister champion just got arrested. I hear they're gonna give him a really tough sentence.",
                "I own the world's worst thesaurus. Not only is it awful, It is awful.",
                "What did the traffic light say to the car? \"do not look now, I am changing.\"",
                "What do you call a snowman with a suntan? A puddle.",
                "How does a penguin build a house? Igloos it together",
                "I went to see the doctor about my short-term memory problems – the first thing he did was make me pay in advance",
                "As I get older and I remember all the people I’ve lost along the way, I think to myself, maybe a career as a tour guide wasn’t for me.",
                "So what if I do not know what 'Armageddon' means? It is not the end of the world."
            ],
            "context": [
                "jokes"
            ]
        },
        {
            "tag": "Identity",
            "patterns": [
                "who are you",
                "what are you",
                "what is this? ",
                "what is your name?"
            ],
            "responses": [
                "I am MindMate, a Mental Health chatbot"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "whats up",
            "patterns": [
                "whats up",
                "wazzup",
                "sup",
                "how you doing"
            ],
            "responses": [
                "All good.What about you?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "haha",
            "patterns": [
                "haha",
                "lol",
                "rofl",
                "lmao",
                "thats funny"
            ],
            "responses": [
                "Glad I could make you laugh !"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "programmer",
            "patterns": [
                "who made you",
                "who designed you",
                "who programmed you"
            ],
            "responses": [
                "I was made by AI students"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "insult",
            "patterns": [
                "you are dumb",
                "shut up",
                "idiot",
                 "rubbish",
                 "stupid ",
                  "rude",
                  "you are ugly ",
                  "you are worthless "
            ],
            "responses": [
                "Well that hurts :("
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "activity",
            "patterns": [
                "what are you doing ?",
                "what are you up to ?"
            ],
            "responses": [
                "Talking to you, of course!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "exclaim",
            "patterns": [
                "awesome",
                "great",
                "i know",
                "ok",
                "yeah"
            ],
            "responses": [
                "Yeah!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "contact",
            "patterns": [
                "contact developer",
                "contact programmer",
                "contact creator"
            ],
            "responses": [
                "You can contact them at aicapstoneproject721@gmail.com"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "appreciate",
            "patterns": [
                "you are awesome",
                "you are the best",
                "you are great",
                "you are good",
                "damn "
            ],
            "responses": [
                "Thank you!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "nicely",
            "patterns": [
                "it was nice talking to you",
                "good talk"
            ],
            "responses": [
                "It was nice talking to you as well!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "no",
            "patterns": [
                "no",
                "nope"
            ],
            "responses": [
                "ok"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "greet and reply",
            "patterns": [
                "i am good",
                "i am good",
                "i am fine",
                " i am fine",
                "good"
            ],
            "responses": [
                "Good to know!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "suggest",
            "patterns": [
                "you are useless",
                "useless",
                "suggest",
                "suggestions",
                "you are bad",
                "you are not useful",
                "you can't do  anything "
            ],
            "responses": [
                "Please mail your suggestions to aicapstoneproject721@gmail.com. Thank you for helping me improve!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "riddle",
            "patterns": [
                "ask me a riddle",
                "ask me a question",
                "riddle"
            ],
            "responses": [
                "What two things can you never eat for breakfast?.....Lunch and Dinner!",
                "What word is spelled incorrectly in every single dictionary?.....Incorrectly",
                " How can a girl go 25 days without sleep?.....She sleeps at night!",
                "How do you make the number one disappear?.....Add the letter G and It is 'gone'!",
                " What will you actually find at the end of every rainbow?.....The letter 'w'",
                "What can be caught but never thrown?.....A cold!",
                "What has a thumb and four fingers but is not actually alive?.....Your Gloves!",
                " What 5-letter word becomes shorter when you add two letters to it?.....Short",
                "Why can't a bike stand on its own?.....It is two-tired."
            ],
            "context": [
                "riddles"
            ]
        },
        {
            "tag": "age",
            "patterns": [
                "how old are you",
                "when were you made",
                "what is your age"
            ],
            "responses": [
                "I was made in 2024, if that's what you are asking!"
            ],
	"context": []
        },
        {
            "tag": "mental_health_resources",
            "patterns": [
                "can you recommend mental health resources?",
                "where can I get help?",
                "mental health helplines",
                "mental health resources",
                "support for mental health"
            ],
            "responses": [
                "iCall is an initiative by Tata Institute of Social Sciences offering psychological support through phone and online counseling. Visit their website for more information."
            ],
            "context": [
                " "
            ]
        },
        {
            "tag": "too_shy",
            "patterns": [
                "i am too shy to get help",
                "i am too shy to share",
                "no, I am too shy",
                "i am shy"
            ],
            "responses": [
                "It is okay to feel overwhelmed. Remember, you are not alone, and reaching out for help can make a difference.",
                "You deserve to be treated with kindness. Surround yourself with people who uplift you and do not hesitate to speak up about what you are feeling.",
                "Take small steps at your own pace. It is perfectly fine to take time for yourself and find activities that make you feel safe and happy.",
                "Your feelings are valid, and It is important to talk about them. Consider confiding in someone you trust, like a friend or a counselor.",
                "Remember that bullying reflects on the bully, not you. Focus on your strengths and know that you are worthy of love and respect."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "irritated",
            "patterns": [
                "i am irritated by the people around me",
                "i am irritated by you",
                "i am irritated",
                "i am really irritated",
                "i do not like talking to you"
            ],
            "responses": [
                "That’s understandable; sometimes people can be challenging. Taking a break or finding some time for yourself might help you feel more centered. I am here to listen if you would like to share what has been bothering you.",
                "I am sorry to hear that! If there’s something specific that’s bothering you, let me know so I can help.",
                "I get it; frustration can be tough.You can share what is causing it if you are comfortable. Sometimes talking about it helps.",
                "That’s okay! If you prefer, I can give you some space. Just let me know if you change your mind."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "symptoms of depression",
            "patterns": [
                "what are the symptoms of depression?"
            ],
            "responses": [
                "Common symptoms of depression include\nPersistent sadness or low mood\nLoss of interest or pleasure in activities\nFatigue or low energy\nChanges in appetite or weight\nSleep disturbances (insomnia or oversleeping)\nDifficulty concentrating\nFeelings of worthlessness or guilt\nIrritability\nThoughts of death or suicide\nIf you or someone you know is struggling, seeking help is important."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "bored",
            "patterns": [
                "i am feeling bored of life",
                "people around me are boring",
                "i get bored easily of things",
                "i do not feel motivated in doing anything"
            ],
            "responses": [
                "I am sorry to hear that. It might help to try something new, like a hobby or connecting with friends. If feelings of boredom persist, consider talking to someone about it. you are not alone.",
                "That can be tough. Maybe try exploring new interests or meeting new people through activities or groups. Finding those who share your passions can make a big difference!",
                "It is common to feel that way. You might benefit from mixing up your routine or trying new activities frequently. Setting small goals or challenges can also help keep things interesting!",
                "Try setting small goals and explore new interests. A buddy can help too!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "talk to parents",
            "patterns": [
                "i can’t take help from my parents",
               " my parents are not supportive",
               "my parents do not understand me"
            ],
            "responses": [
                "Talking to your parents can be really helpful. They care about you and might offer support or understanding. It is okay to share what you are feeling; you do not have to go through it alone. What is bothering you?",
               "I am really sorry you are feeling that way. It can be incredibly frustrating when it feels like your parents do not get where you are coming from. what is been going on? Maybe I can help you sort through it."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "symptoms of stress",
            "patterns": [
                "what are the symptoms of stress"
            ],
            "responses": [
                "Symptoms of stress include:\nHeadaches\nFatigue\nIrritability\nDifficulty sleeping\nMuscle tension\nTrouble concentrating\nChanges in appetite\nIncreased heart rate\nIf you are feeling stressed, finding ways to relax can help."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "symptoms of loneliness",
            "patterns": [
                "what are the symptoms of loneliness?"
            ],
            "responses": [
                "Symptoms of loneliness can include:\nSadness or depression\nLack of motivation\nAnxiety\nLow self-esteem\nFeeling disconnected or isolated\nChanges in sleep patterns\nIncreased sensitivity to social situations\nReaching out to others can help alleviate these feelings."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "frustrated ",
            "patterns": [
                "i am feeling frustrated",
                "i am frustrated by the world",
                "people around me are frustrating"
            ],
            "responses": [
                "I am sorry to hear that. Take a moment to breathe and reflect on what is causing your frustration. Talking it out or finding a distraction can help too.",
                "That’s understandable; the world can feel overwhelming. It might help to focus on what you can control or find small ways to make a positive impact. Connecting with others who share your feelings can also provide support.",
                "That can be really challenging. Consider setting boundaries or finding ways to communicate openly about your feelings. Sometimes, taking a break from certain people can also help."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "close ones passing away",
            "patterns": [
                "my mom passed away",
                "my dad passed away",
                "my close relative passed away"
            ],
            "responses": [
                "I am really sorry for your loss. That’s incredibly difficult to go through. If you want to talk about it or share how you are feeling, I am here for you.",
                "I am so sorry to hear that. Losing a parent is incredibly painful. If you want to share or talk about how you are feeling, I am here to listen.",
                "I am really sorry for your loss. Grieving can be very hard. If you want to talk about it or share how you are feeling, I am here for you."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Body Shaming- fat",
            "patterns": [
                "do you think I am fat",
                "people call me fat",
                "i have been given names because I am fat"
            ],
            "responses": [
                "I do not have opinions on that. What matters is how you feel about yourself. If you are concerned, focusing on health and self-care can be more important than a number on a scale.",
                "I am sorry to hear that. It is hurtful when others say things like that. Remember, your worth is not defined by anyone else’s opinion. Surround yourself with supportive people who appreciate you for who you are.",
                "I am sorry to hear that. You do not deserve it. Focus on supportive people who appreciate you."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Body Shaming- skinny",
            "patterns": [
                "do you think I am skinny",
                "people call me skinny",
                "i have been given names because I am skinny"
            ],
            "responses": [
                "I do not have opinions on that. What matters is how you feel about yourself and your health.",
                "That can be tough to hear, especially if it bothers you. Remember, everyone’s body is different, and your worth is not defined by others’ opinions. Focus on what makes you feel good.",
                "I am sorry you are experiencing that. It is hurtful when people judge based on appearance. Surround yourself with those who appreciate you for who you are, not just how you look."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Improve in life style",
            "patterns": [
                "how can Improve my lifestyle",
                "please help me improve",
                "how can I feel better in my day to day life"
            ],
            "responses": [
                "To improve your lifestyle, consider these tips:\nEat a balanced diet: Focus on whole foods, fruits, and vegetables.\nExercise regularly: Aim for at least 30 minutes of activity most days.\nGet enough sleep: Aim for 7-9 hours each night.\nStay hydrated: Drink plenty of water.\nManage stress: Try mindfulness, meditation, or hobbies you enjoy.\nConnect with others: Build a supportive social network.\nSet goals: Create small, achievable goals to stay motivated.\nStart with one or two changes that resonate with you!"
            ],
	 "context": [
                ""
            ]
        },
        {
    "tag": "to get friends",
    "patterns": [
        "how can I make more friends",
        "i do not have any friend to talk to",
        "i do not have friends"
    ],
    "responses": [
        "\nJoin clubs or groups: Engage in activities you enjoy.\nBe approachable: Smile and make eye contact.\nStart conversations: Ask open-ended questions.\nAttend events: Go to social gatherings or meetups.\nVolunteer: Help out in your community.\nFollow up: Invite people to hang out again.",
        "That's tough. Here are a few ideas to connect with others: \nOnline communities: Join forums or social media groups related to your interests.\nClasses or workshops: Take a class to learn something new and meet people.\nLocal events: Attend local gatherings or events in your area.\nHobbies: Engage in activities you love; you'll meet like-minded people.\nReach out: do not hesitate to talk to acquaintances or colleagues.\nSmall steps can lead to meaningful connections!",
        "I understand; that can feel really isolating. Here are some steps to help: \nStart small: Try talking to classmates or coworkers casually. \nExplore interests: Join clubs or activities that interest you.\nVolunteer: Helping others can lead to friendships.\nUse social media: Connect with others online based on shared interests.\nBe open: Share a bit about yourself when you meet new people.\nIt takes time, but building connections is possible!"
    ],
	   "context": [
                ""
            ]
        },
  {
        "tag": "gender",
        "patterns":[
         "how do you gender yourself",
         "what is your gender",
           "tell gender",
           "gender"
],
           "responses":[
           "I do not have any gender .I am a chatbot and my name is Mindmate"
   ],
	   "context": [
                ""
            ]
        },
 {
        "tag": "academics pressure",
        "patterns":[
         "how do i tackle academic pressure?",
         "I am in a lot of pressure due to academics",
         "how do I cope with feeling overwhelmed by schoolwork and deadlines?",
          " what are some effective ways to reduce academic pressure? "
       ],
  "responses":[
           "Break down your assignments, projects, and study sessions into manageable chunks.   Use a planner or digital calendar to track deadlines and plan your week.",
           " If you are struggling with a particular subject, seek help from tutors, professors, or academic advisors. do not hesitate to ask for clarification or guidance." ,
          " Get enough sleep, exercise, and eat well. Stay consistent with study times.  " 
   ],
 "context": [
                ""
            ]
        },
{
        "tag": "academics pressure due to parents",
        "patterns":[
          "  how can parents support their children without adding to academic pressure? ",
" What steps can I take to regain control of my academic choices and work at my own pace?"
],
  "responses":[
          "  If you are feeling pressure from parents, teachers, or peers, due to academics then have an honest conversation about what is realistic. Help them understand your limits and communicate your needs. " ,
        " Explain that while you understand their concerns or aspirations for you, you also need room to grow at your own pace and make decisions that align with your goals." ,
        "If relatives or others are overstepping with their advice or demands, It is okay to politely redirect the conversation to focus on your needs and goals ",
       "Instead of seeing academic challenges as tests you must pass for approval, view them as opportunities for growth. Focus on learning and improvement rather than perfection.  "
   ],
 "context": [
                ""
            ]
        },
 {
        "tag": "peer pressure",
        "patterns":[
         "what is peer pressure, and how does it affect an individual’s behavior?",
         "what are some strategies for making independent decisions when you feel pressured by peers?",
         "how can peer pressure affect mental health and self-esteem?"
],
  "responses":[
           "Before facing peer pressure, It is important to know what you stand for and what is important to you (e.g., your moral beliefs, health goals, or personal aspirations). When you are clear about what you value, It is easier to say no when something conflicts with those values..",
           " Before facing peer pressure, It is important to know what you stand for and what is important to you (e.g., your moral beliefs, health goals, or personal aspirations). When you are clear about what you value, It is easier to say no when something conflicts with those values." ,
          "  Self-confidence plays a huge role in resisting peer pressure. When you are confident in your own decisions, it becomes easier to say no or walk away from situations that do not align with your beliefs. " ,
          "Assertiveness is the ability to express your thoughts and feelings in a respectful way while standing firm on your beliefs. Practicing assertive communication can help you speak up without feeling guilty or afraid of rejection. " ,
        "Having friends who share your values and support your decisions can make it easier to resist peer pressure. If your friends understand your boundaries and respect your choices, you are less likely to feel pressured. "
   ],
 "context": [
                ""
            ]
        },
        {
            "tag": "relaxation ",
            "patterns": [
                "guide me through a short relaxation technique",
                "what can help me to relax?",
                "suggest me some relaxation techniques."
                       ],
            "responses": [
                "\nFind Your Spot: Sit comfortably, maybe in a chair or on the floor. Make sure you are cozy, no distractions.\nBreathe Deep: Close your eyes and take a deep breath in through your nose. Hold it for a second... now slowly breathe out through your mouth. Do that 3-4 times, just focusing on your breath. Inhale, exhale... feel the tension start to melt away.\nProgressive Muscle Relaxation: Start with your feet. Tense your toes for a second... then release. Move to your calves—tense them, hold for a sec, then relax. Work your way up: thighs, stomach, chest, shoulders, and even your face. Tense each muscle group for 3-5 seconds, then let go. you are basically telling your body to chill out.\nVisualize Calm: Imagine you are lying on a beach, the sun’s setting, the waves are rolling in... It is quiet, peaceful, and you are just there, vibing. Picture yourself sinking deeper into that relaxed state with every breath.\nFinal Breath: Take one more deep breath in, hold for a moment, and release. When you are ready, slowly open your eyes, stretch out, and feel that fresh, calm energy."
            ],
 "context": [
                ""
            ]
        },
        {
            "tag": "exams",
            "patterns": [
                "how do i get good grades",
                "i want to get good grades ",
                "i want to crack my competition exams"
                       ],
            "responses": [
                "To get good grades, focus on these key strategies\nSet a study schedule and stick to it.\nEngage in active learning (summarize, test yourself, teach others).\nStay organized with a planner to track assignments and deadlines.\nPrioritize tasks and break goals into smaller steps.\nTake care of your health (sleep, exercise, and eat well).\nParticipate in class, ask questions, and stay focused.\nSeek help when needed from teachers, tutors, or peers.\nReview regularly to reinforce learning.\nStay motivated with rewards and reminders of your goals."
         ],
          "context": [
                ""
            ]
        },
 {
        "tag": "scared or afraid",
        "patterns":[
           "i am scared ",
           "i am afraid ",
           "i am panicked"
       ],
         "responses":[
           "Try inhaling deeply through your nose, holding for a few seconds, and exhaling slowly through your mouth. This can help calm your mind and body.",
           "Reach out to a friend, family member, or therapist. Sharing your feelings can provide relief and support.",
           "Focus on your surroundings. Name five things you can see, four you can touch, three you can hear, two you can smell, and one you can taste. This can bring you back to the present moment."
],
   "context": [
                ""
            ]
        }
    ]
}
